# Brewfile — arche macOS package registry (CLI + terminal only).
# Declarative counterpart to packages/*.sh. Installed idempotently with:
#   brew bundle --file=macos/Brewfile
#
# Scope: the cross-platform tools shared with the Linux setup — shell,
# terminal, editor, and CLI utilities. No window-manager / system-level
# packages (those are Linux-only: Hyprland, dms, pacman hooks, etc.).
#
# Target: Apple Silicon (arm64), current macOS only.

# ─── Core ───
brew "git"
brew "stow"        # symlink dotfiles (same mechanism as Linux)
brew "just"        # task runner
brew "wget"
brew "coreutils"   # GNU coreutils (greadlink etc.) for portable scripts
brew "gettext"     # provides envsubst — required by the theme engine
brew "p7zip"

# ─── Shell + prompt + terminal ───
brew "fish"        # primary shell (default login shell)
brew "atuin"       # SQLite history + Ctrl-R
brew "starship"    # cross-shell prompt
brew "tmux"        # terminal multiplexer

# ─── Editor ───
brew "neovim"

# ─── Modern CLI replacements ───
brew "eza"         # ls
brew "bat"         # cat
brew "ripgrep"     # grep
brew "fd"          # find
brew "fzf"         # fuzzy finder
brew "zoxide"      # cd
brew "dust"        # du
brew "btop"        # top
brew "jq"          # JSON
brew "yq"          # YAML
brew "tealdeer"    # tldr — simplified man pages
brew "gum"         # CLI prompts / spinners / formatting
brew "lazygit"     # TUI git client
brew "lazydocker"  # TUI docker client

# ─── App CLIs ───
brew "glow"        # markdown viewer
brew "aria2"       # download manager
brew "fastfetch"   # system info
brew "gh"          # GitHub CLI
brew "tree-sitter" # tree-sitter CLI

# ─── Runtimes referenced by fish conf.d (guarded — safe if unused) ───
brew "fnm"         # Fast Node Manager (conf.d/fnm.fish)
brew "uv"          # Python package manager (conf.d/uv.fish)

# ─── Terminal + media apps (casks) ───
cask "ghostty"     # terminal emulator — native macOS feel, themed via the engine
cask "mpv"         # media player (stowed config)

# ─── Fonts (theme uses this family) ───
cask "font-jetbrains-mono-nerd-font"  # FONT_MONO — JetBrainsMono Nerd Font Mono
